vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA165_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_swo' Cversion='1.0.0' condition='component.serial_manager_swo.condition_id'>
      <description>Component serial_manager_swo</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SWO
#define SERIAL_PORT_TYPE_SWO 1
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/serial_manager/fsl_component_serial_port_swo.h' projectpath='component/serial_manager'/>
        <file category='sourceC' name='components/serial_manager/fsl_component_serial_port_swo.c' projectpath='component/serial_manager'/>
        <file category='include' name='components/serial_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart' Cversion='1.0.0' condition='component.serial_manager_uart.condition_id'>
      <description>Component serial_manager_uart</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_UART
#define SERIAL_PORT_TYPE_UART 1
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/serial_manager/fsl_component_serial_port_uart.h' projectpath='component/serial_manager'/>
        <file category='sourceC' name='components/serial_manager/fsl_component_serial_port_uart.c' projectpath='component/serial_manager'/>
        <file category='include' name='components/serial_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_virtual' Cversion='1.0.0' condition='component.serial_manager_virtual.condition_id'>
      <description>Component serial_manager_virtual</description>
      <RTE_Components_h>
        #ifndef SSERIAL_PORT_TYPE_VIRTUAL
        #define SSERIAL_PORT_TYPE_VIRTUAL 1
        #endif
        #ifndef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING 1
        #endif
      </RTE_Components_h>
      <files>
        <file category='header' name='components/serial_manager/fsl_component_serial_port_virtual.h' projectpath='component/serial_manager'/>
        <file category='sourceC' name='components/serial_manager/fsl_component_serial_port_virtual.c' projectpath='component/serial_manager'/>
        <file category='include' name='components/serial_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='timer_manager' Cversion='1.0.0' condition='component.timer_manager.condition_id'>
      <description>Component timer_manager</description>
      <files>
        <file category='header' name='components/timer_manager/fsl_component_timer_manager.h' projectpath='component/timer_manager'/>
        <file category='sourceC' name='components/timer_manager/fsl_component_timer_manager.c' projectpath='component/timer_manager'/>
        <file category='include' name='components/timer_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='CMSIS' Csub='MCXA165_header' Cversion='1.0.0' condition='device.CMSIS.condition_id'>
      <description>Device MCXA165_cmsis</description>
      <files>
        <file category='header' name='devices/MCXA165/fsl_device_registers.h' projectpath='device'/>
        <file category='header' name='devices/MCXA165/MCXA165.h' projectpath='device'/>
        <file category='header' name='devices/MCXA165/MCXA165_features.h' projectpath='device'/>
        <file category='header' name='devices/MCXA165/MCXA165_COMMON.h' projectpath='device'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_ADC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_AOI.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_CAN.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_CDOG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_CMC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_CRC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_CTIMER.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_DEBUGMAILBOX.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_DIGTMP.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_DMA.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_EIM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_EQDC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_ERM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_FLEXIO.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_FMC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_FMU.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_FREQME.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_GLIKEY.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_GPIO.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_I3C.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_INPUTMUX.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_LPCMP.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_LPDAC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_LPI2C.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_LPSPI.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_LPTMR.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_LPUART.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_MAU.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_MRCC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_OPAMP.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_OSTIMER.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_PKC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_PORT.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_PWM.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_RTC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_SCG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_SGI.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_SLCD.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_SMARTDMA.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_SPC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_SYSCON.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_TRDC.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_TRNG.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_UDF.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_USB.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_UTICK.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_VBAT.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_WAKETIMER.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_WUU.h' projectpath='device/periph2'/>
        <file category='header' name='devices/MCXA165/periph2/PERI_WWDT.h' projectpath='device/periph2'/>
        <file category='include' name='devices/MCXA165/'/>
        <file category='include' name='devices/MCXA165/periph2/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device' Cversion='1.0.0' condition='device.RTE.condition_id'>
      <description>Rte_device</description>
      <files>
        <file category='header' attr='config' name='devices/MCXA165/template/RTE_Device.h' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MCXA165/template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='MCXA165_linker' Cversion='1.0.0' condition='device.linker.condition_id'>
      <description>Device MCXA165_linker</description>
      <files>
        <file condition='allOf.toolchains=mdk, device_ids=MCXA165.condition_id' category='linkerScript' name='devices/MCXA165/arm/MCXA165_flash.scf' projectpath='MCXA165/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MCXA165.condition_id' category='linkerScript' name='devices/MCXA165/arm/MCXA165_ram.scf' projectpath='MCXA165/arm'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MCXA165.condition_id' category='linkerScript' name='devices/MCXA165/gcc/MCXA165_flash.ld' projectpath='MCXA165/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MCXA165.condition_id' category='linkerScript' name='devices/MCXA165/gcc/MCXA165_ram.ld' projectpath='MCXA165/gcc'/>
        <file condition='allOf.toolchains=iar, device_ids=MCXA165.condition_id' category='linkerScript' name='devices/MCXA165/iar/MCXA165_flash.icf' projectpath='MCXA165/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MCXA165.condition_id' category='linkerScript' name='devices/MCXA165/iar/MCXA165_ram.icf' projectpath='MCXA165/iar'/>
      </files>
    </component>
