vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA165_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi_edma' Cversion='2.4.6' condition='driver.lpspi_edma.condition_id'>
      <description>LPSPI Driver</description>
      <files>
        <file category='header' name='devices/MCXA165/drivers/fsl_lpspi_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_lpspi_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr' Cversion='2.2.0' condition='driver.lptmr.condition_id'>
      <description>LPTMR Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_lptmr.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA165/drivers/fsl_lptmr.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart' Cversion='2.9.0' condition='driver.lpuart.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MCXA165/drivers/fsl_lpuart.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_lpuart.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_edma' Cversion='2.6.0' condition='driver.lpuart_edma.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MCXA165/drivers/fsl_lpuart_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_lpuart_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lsm6dso' Cversion='1.0.0' condition='driver.lsm6dso.condition_id'>
      <description>Driver lsm6dso</description>
      <files>
        <file category='header' name='components/sensor/lsm6dso/fsl_lsm.h' projectpath='tilt_pedo'/>
        <file category='sourceC' name='components/sensor/lsm6dso/fsl_lsm.c' projectpath='tilt_pedo'/>
        <file category='include' name='components/sensor/lsm6dso/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mau' Cversion='2.0.0' condition='driver.mau.condition_id'>
      <description>MAU Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_mau.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA165/drivers/fsl_mau.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='max30101' Cversion='1.0.0' condition='driver.max30101.condition_id'>
      <description>Driver max30101</description>
      <files>
        <file category='header' name='components/sensor/max30101/fsl_max.h' projectpath='heartrate'/>
        <file category='sourceC' name='components/sensor/max30101/fsl_max.c' projectpath='heartrate'/>
        <file category='include' name='components/sensor/max30101/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_cmc' Cversion='2.2.3' condition='driver.mcx_cmc.condition_id'>
      <description>MCX_CMC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_cmc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA165/drivers/fsl_cmc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_spc' Cversion='2.7.0' condition='driver.mcx_spc.condition_id'>
      <description>MCX SPC Driver</description>
      <files>
        <file category='header' name='devices/MCXA165/drivers/fsl_spc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_spc.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_vbat' Cversion='2.3.1' condition='driver.mcx_vbat.condition_id'>
      <description>MCX VBAT Driver</description>
      <files>
        <file category='header' name='devices/MCXA165/drivers/fsl_vbat.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_vbat.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mma8451q' Cversion='1.0.0' condition='driver.mma8451q.condition_id'>
      <description>Driver mma8451q</description>
      <files>
        <file category='header' name='components/sensor/mma8451q/fsl_mma.h' projectpath='accel'/>
        <file category='sourceC' name='components/sensor/mma8451q/fsl_mma.c' projectpath='accel'/>
        <file category='include' name='components/sensor/mma8451q/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mma8652fc' Cversion='1.0.0' condition='driver.mma8652fc.condition_id'>
      <description>Driver mma8652fc</description>
      <files>
        <file category='header' name='components/sensor/mma8652fc/fsl_mma.h' projectpath='accel'/>
        <file category='sourceC' name='components/sensor/mma8652fc/fsl_mma.c' projectpath='accel'/>
        <file category='include' name='components/sensor/mma8652fc/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='opamp' Cversion='2.0.0' condition='driver.opamp_fast.condition_id'>
      <description>OPAMP Driver</description>
      <files>
        <file category='header' name='devices/MCXA165/drivers/fsl_opamp.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_opamp.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ostimer' Cversion='2.2.2' condition='driver.ostimer.condition_id'>
      <description>OSTimer Driver</description>
      <files>
        <file category='header' name='devices/MCXA165/drivers/fsl_ostimer.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA165/drivers/fsl_ostimer.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA165/drivers/'/>
      </files>
    </component>
